//
//  Task-14.swift
//  OTUS-HW-2
//
//  Created by Егор Бадмаев on 01.10.2022.
//

/**
 # Продвинутые функции и замыкания
 
 ## Цель:
 
 Закрепить знания, полученные во время лекции

 ## Описание/Пошаговая инструкция выполнения домашнего задания:
 
 Напишите несколько примеров и функций:

 * Функция, принимающая функцию как параметр
 * Функция с несколькими замыканиями
 * Функция с autoclosure
 * Использование внутренних функций
 * Дженерик-функция с условием
 * В Playground добавьте пример для демонстрации работы.

 ## Критерии оценки:
 
 *  Факт сдачи - 40 баллов
 * Функция, принимающая функцию как параметр - 10 баллов
 * Функция с несколькими замыканиями - 10 баллов
 * Функция с autoclosure - 10 баллов
 * Использование внутренних функций - 10 баллов
 * Дженерик-функция с условием - 10 баллов
 * Наличие примера - 10 баллов
 
 ## Примечание:
 Этот проект создан как macOS/Command Line Tool и в целом ничем не отличается от обычного Playground за исключением той детали, что вам не приходится ждать по 10 минут (или перезапускать по 10 раз Xcode), пока не запустится Playground: тут всё срабатывает моментально.
 */

