//
//  Task-13.swift
//  OTUS-HW-2
//
//  Created by Егор Бадмаев on 01.10.2022.
//

/**
 # Создание класса-дженерика
 
 ## Цель:
 
 Закрепить знания, полученные на лекции

 ## Описание/Пошаговая инструкция выполнения домашнего задания:
 
 1. Реализуйте дженерик-класс для структуры данных Stack, Deque или Queue.
 2. Класс должен содержать дженерик-методы согласно выбранному типу структуры данных.
 3. В Playground основном пространстве напишите пример с использованием созданного класса
 https://ru.wikipedia.org/wiki/Двухсторонняя_очередь
 https://ru.wikipedia.org/wiki/Стек
 https://ru.wikipedia.org/wiki/Очередь_(программирование)

 ## Критерии оценки:
 
 Факт сдачи - 40 баллов
 Реализация класса выбранного типа - 30 баллов
 Пример с использованием - 20 баллов
 
 ## Примечание:
 Этот проект создан как macOS/Command Line Tool и в целом ничем не отличается от обычного Playground за исключением той детали, что вам не приходится ждать по 10 минут (или перезапускать по 10 раз Xcode), пока не запустится Playground: тут всё срабатывает моментально.
 */

